In [1]:
from pyspark.sql import SparkSession

In [2]:
spark =SparkSession.builder.appName('Practice-2').getOrCreate()

Setting default log level to "WARN".
To adjust logging level use sc.setLogLevel(newLevel). For SparkR, use setLogLevel(newLevel).
24/12/26 16:11:27 WARN NativeCodeLoader: Unable to load native-hadoop library for your platform... using builtin-java classes where applicable
24/12/26 16:11:29 WARN Utils: Service 'SparkUI' could not bind on port 4040. Attempting port 4041.
24/12/26 16:11:29 WARN Utils: Service 'SparkUI' could not bind on port 4041. Attempting port 4042.
/Users/aakashbolisetty/.pyenv/versions/3.7.5/lib/python3.7/site-packages/pyspark/context.py:317: FutureWarning: Python 3.7 support is deprecated in Spark 3.4.
  warnings.warn("Python 3.7 support is deprecated in Spark 3.4.", FutureWarning)

In [3]:
df_pyspark=spark.read.csv('employees.csv',header=True,inferSchema=True)
df_pyspark.show()

+---+---------+--------+----------+----------+-------------------+------+---------------+
| ID|FirstName|LastName|Department|     Phone|            Address|Salary|         Skills|
+---+---------+--------+----------+----------+-------------------+------+---------------+
|  1|     Luke| Phillip|     Sales|1234567890| 1st Address, Miami| 52000|   Online Sales|
|  2|     Jack|  Darren|        IT|1234567891| 2nd Address, Miami| 52200|     Networking|
|  3|      Ken|    Wood|        IT|1234567892| 3rd Address, Miami| 58000|   Python, Java|
|  4|     John|  Wilson| Marketing|1234567893| 4th Address, Miami| 58700|   Facebook Ads|
|  5|    Emily|  Larson| Marketing|1234567894| 5th Address, Miami| 60000|  Instagram Ads|
|  6|     Anna|Sullivan|     Sales|1234567895| 6th Address, Miami| 54000|In-Person Sales|
|  7|  Richard|   Smith| Logistics|1234567896| 7th Address, Miami| 56000|Warehouse Mgmt.|
|  8|   Ronnie|   Moore|     Sales|1234567897| 8th Address, Miami| 49000|   Online Sales|
|  9|     null|   Drake|        IT|1234567898| 9th Address, Miami| 53000|  Linux Servers|
| 10|    Wayne|  Barker| Logistics|1234567899|10th Address, Miami|  null|Product Loading|
+---+---------+--------+----------+----------+-------------------+------+---------------+

In [6]:
#Drop the column

df_pyspark.drop('ID').show()

+---------+--------+----------+----------+-------------------+------+---------------+
|FirstName|LastName|Department|     Phone|            Address|Salary|         Skills|
+---------+--------+----------+----------+-------------------+------+---------------+
|     Luke| Phillip|     Sales|1234567890| 1st Address, Miami| 52000|   Online Sales|
|     Jack|  Darren|        IT|1234567891| 2nd Address, Miami| 52200|     Networking|
|      Ken|    Wood|        IT|1234567892| 3rd Address, Miami| 58000|   Python, Java|
|     John|  Wilson| Marketing|1234567893| 4th Address, Miami| 58700|   Facebook Ads|
|    Emily|  Larson| Marketing|1234567894| 5th Address, Miami| 60000|  Instagram Ads|
|     Anna|Sullivan|     Sales|1234567895| 6th Address, Miami| 54000|In-Person Sales|
|  Richard|   Smith| Logistics|1234567896| 7th Address, Miami| 56000|Warehouse Mgmt.|
|   Ronnie|   Moore|     Sales|1234567897| 8th Address, Miami| 49000|   Online Sales|
|     null|   Drake|        IT|1234567898| 9th Address, Miami| 53000|  Linux Servers|
|    Wayne|  Barker| Logistics|1234567899|10th Address, Miami|  null|Product Loading|
+---------+--------+----------+----------+-------------------+------+---------------+

In [8]:
#By default delete any rows with null values in any column
df_pyspark.na.drop().show()

+---+---------+--------+----------+----------+------------------+------+---------------+
| ID|FirstName|LastName|Department|     Phone|           Address|Salary|         Skills|
+---+---------+--------+----------+----------+------------------+------+---------------+
|  1|     Luke| Phillip|     Sales|1234567890|1st Address, Miami| 52000|   Online Sales|
|  2|     Jack|  Darren|        IT|1234567891|2nd Address, Miami| 52200|     Networking|
|  3|      Ken|    Wood|        IT|1234567892|3rd Address, Miami| 58000|   Python, Java|
|  4|     John|  Wilson| Marketing|1234567893|4th Address, Miami| 58700|   Facebook Ads|
|  5|    Emily|  Larson| Marketing|1234567894|5th Address, Miami| 60000|  Instagram Ads|
|  6|     Anna|Sullivan|     Sales|1234567895|6th Address, Miami| 54000|In-Person Sales|
|  7|  Richard|   Smith| Logistics|1234567896|7th Address, Miami| 56000|Warehouse Mgmt.|
|  8|   Ronnie|   Moore|     Sales|1234567897|8th Address, Miami| 49000|   Online Sales|
+---+---------+--------+----------+----------+------------------+------+---------------+

In [9]:
##Arguments for drop
#how = 'any' is default and removes a row if even one value is null 
#and how = 'all' will remove a row only if all values are null
df_pyspark.na.drop(how='all').show()

+---+---------+--------+----------+----------+-------------------+------+---------------+
| ID|FirstName|LastName|Department|     Phone|            Address|Salary|         Skills|
+---+---------+--------+----------+----------+-------------------+------+---------------+
|  1|     Luke| Phillip|     Sales|1234567890| 1st Address, Miami| 52000|   Online Sales|
|  2|     Jack|  Darren|        IT|1234567891| 2nd Address, Miami| 52200|     Networking|
|  3|      Ken|    Wood|        IT|1234567892| 3rd Address, Miami| 58000|   Python, Java|
|  4|     John|  Wilson| Marketing|1234567893| 4th Address, Miami| 58700|   Facebook Ads|
|  5|    Emily|  Larson| Marketing|1234567894| 5th Address, Miami| 60000|  Instagram Ads|
|  6|     Anna|Sullivan|     Sales|1234567895| 6th Address, Miami| 54000|In-Person Sales|
|  7|  Richard|   Smith| Logistics|1234567896| 7th Address, Miami| 56000|Warehouse Mgmt.|
|  8|   Ronnie|   Moore|     Sales|1234567897| 8th Address, Miami| 49000|   Online Sales|
|  9|     null|   Drake|        IT|1234567898| 9th Address, Miami| 53000|  Linux Servers|
| 10|    Wayne|  Barker| Logistics|1234567899|10th Address, Miami|  null|Product Loading|
+---+---------+--------+----------+----------+-------------------+------+---------------+

In [12]:
##Threshold (Thresh)
## if it has minimum thresh no.of non null values then it keeps the data, if not the row would be filtered out
df_pyspark.na.drop(how='any',thresh=7).show()

+---+---------+--------+----------+----------+------------------+------+---------------+
| ID|FirstName|LastName|Department|     Phone|           Address|Salary|         Skills|
+---+---------+--------+----------+----------+------------------+------+---------------+
|  1|     Luke| Phillip|     Sales|1234567890|1st Address, Miami| 52000|   Online Sales|
|  2|     Jack|  Darren|        IT|1234567891|2nd Address, Miami| 52200|     Networking|
|  3|      Ken|    Wood|        IT|1234567892|3rd Address, Miami| 58000|   Python, Java|
|  4|     John|  Wilson| Marketing|1234567893|4th Address, Miami| 58700|   Facebook Ads|
|  5|    Emily|  Larson| Marketing|1234567894|5th Address, Miami| 60000|  Instagram Ads|
|  6|     Anna|Sullivan|     Sales|1234567895|6th Address, Miami| 54000|In-Person Sales|
|  7|  Richard|   Smith| Logistics|1234567896|7th Address, Miami| 56000|Warehouse Mgmt.|
|  8|   Ronnie|   Moore|     Sales|1234567897|8th Address, Miami| 49000|   Online Sales|
|  9|     null|   Drake|        IT|1234567898|9th Address, Miami| 53000|  Linux Servers|
+---+---------+--------+----------+----------+------------------+------+---------------+

In [13]:
##subset argument in drop will only filter out the row if the value in that column is null
df_pyspark.na.drop(how='any',subset=['FirstName']).show()

+---+---------+--------+----------+----------+-------------------+------+---------------+
| ID|FirstName|LastName|Department|     Phone|            Address|Salary|         Skills|
+---+---------+--------+----------+----------+-------------------+------+---------------+
|  1|     Luke| Phillip|     Sales|1234567890| 1st Address, Miami| 52000|   Online Sales|
|  2|     Jack|  Darren|        IT|1234567891| 2nd Address, Miami| 52200|     Networking|
|  3|      Ken|    Wood|        IT|1234567892| 3rd Address, Miami| 58000|   Python, Java|
|  4|     John|  Wilson| Marketing|1234567893| 4th Address, Miami| 58700|   Facebook Ads|
|  5|    Emily|  Larson| Marketing|1234567894| 5th Address, Miami| 60000|  Instagram Ads|
|  6|     Anna|Sullivan|     Sales|1234567895| 6th Address, Miami| 54000|In-Person Sales|
|  7|  Richard|   Smith| Logistics|1234567896| 7th Address, Miami| 56000|Warehouse Mgmt.|
|  8|   Ronnie|   Moore|     Sales|1234567897| 8th Address, Miami| 49000|   Online Sales|
| 10|    Wayne|    null| Logistics|1234567899|10th Address, Miami|  null|Product Loading|
+---+---------+--------+----------+----------+-------------------+------+---------------+

In [14]:
##Fill the missing Values
df_pyspark.na.fill('No Data').show()

+---+---------+--------+----------+----------+-------------------+------+---------------+
| ID|FirstName|LastName|Department|     Phone|            Address|Salary|         Skills|
+---+---------+--------+----------+----------+-------------------+------+---------------+
|  1|     Luke| Phillip|     Sales|1234567890| 1st Address, Miami| 52000|   Online Sales|
|  2|     Jack|  Darren|        IT|1234567891| 2nd Address, Miami| 52200|     Networking|
|  3|      Ken|    Wood|        IT|1234567892| 3rd Address, Miami| 58000|   Python, Java|
|  4|     John|  Wilson| Marketing|1234567893| 4th Address, Miami| 58700|   Facebook Ads|
|  5|    Emily|  Larson| Marketing|1234567894| 5th Address, Miami| 60000|  Instagram Ads|
|  6|     Anna|Sullivan|     Sales|1234567895| 6th Address, Miami| 54000|In-Person Sales|
|  7|  Richard|   Smith| Logistics|1234567896| 7th Address, Miami| 56000|Warehouse Mgmt.|
|  8|   Ronnie|   Moore|     Sales|1234567897| 8th Address, Miami| 49000|   Online Sales|
|  9|  No Data|   Drake|        IT|1234567898| 9th Address, Miami| 53000|  Linux Servers|
| 10|    Wayne| No Data| Logistics|1234567899|10th Address, Miami|  null|Product Loading|
+---+---------+--------+----------+----------+-------------------+------+---------------+

In [20]:
from pyspark.ml.feature import Imputer
imputer = Imputer(
inputCols=['Salary'],
outputCols=["{}_imputed".format(c) for c in ['Salary']]
).setStrategy("median")

In [21]:
##Add imputer
imputer.fit(df_pyspark).transform(df_pyspark).show()

+---+---------+--------+----------+----------+-------------------+------+---------------+--------------+
| ID|FirstName|LastName|Department|     Phone|            Address|Salary|         Skills|Salary_imputed|
+---+---------+--------+----------+----------+-------------------+------+---------------+--------------+
|  1|     Luke| Phillip|     Sales|1234567890| 1st Address, Miami| 52000|   Online Sales|         52000|
|  2|     Jack|  Darren|        IT|1234567891| 2nd Address, Miami| 52200|     Networking|         52200|
|  3|      Ken|    Wood|        IT|1234567892| 3rd Address, Miami| 58000|   Python, Java|         58000|
|  4|     John|  Wilson| Marketing|1234567893| 4th Address, Miami| 58700|   Facebook Ads|         58700|
|  5|    Emily|  Larson| Marketing|1234567894| 5th Address, Miami| 60000|  Instagram Ads|         60000|
|  6|     Anna|Sullivan|     Sales|1234567895| 6th Address, Miami| 54000|In-Person Sales|         54000|
|  7|  Richard|   Smith| Logistics|1234567896| 7th Address, Miami| 56000|Warehouse Mgmt.|         56000|
|  8|   Ronnie|   Moore|     Sales|1234567897| 8th Address, Miami| 49000|   Online Sales|         49000|
|  9|     null|   Drake|        IT|1234567898| 9th Address, Miami| 53000|  Linux Servers|         53000|
| 10|    Wayne|    null| Logistics|1234567899|10th Address, Miami|  null|Product Loading|         54000|
+---+---------+--------+----------+----------+-------------------+------+---------------+--------------+